backend/controllers/ContactController.php

    public function actionViewContact( $stakeholder_id )
 {
        // Fetch the stakeholder record to ensure it exists and belongs to the current user ( you may need to adjust this based on your logic )
        $stakeholder = Stakeholder::findOne( [ 'stakeholder_id' => $stakeholder_id ] );

        // Fetch the contacts related to the specified stakeholder_id
        $contacts = Contact::find()->where( [ 'stakeholder_id' => $stakeholder_id ] )->all();
---
SELECT * FROM `stakeholder` WHERE `stakeholder_id`='19'
SELECT * FROM `contacts` WHERE `stakeholder_id`='19'

    public function actionUpdate($id_contacts)
    {
        // Find the contact record to update
        $model = $this->findModel($id_contacts);

        // Get the stakeholder_id from the contact model
        $stakeholder_id = $model->stakeholder_id;

        if (Yii::$app->user->can('update')) {
            if ($this->request->isPost && $model->load($this->request->post()) && $model->save()) {
---
SELECT EXISTS(SELECT * FROM `stakeholder` WHERE `stakeholder`.`stakeholder_id`='16')
UPDATE `contacts` SET `first_name`='zaid', `stakeholder_id`=16 WHERE `id_contacts`=12

    protected function findModel( $id_contacts )
 {
        if ( ( $model = Contact::findOne( [ 'id_contacts' => $id_contacts ] ) ) !== null ) {
---
SELECT * FROM `contacts` WHERE `id_contacts`='12'