backend/controllers/HistoryController.php

SELECT * FROM `stakeholder`
---
    public function actionAddHistory()
    {
        if (Yii::$app->user->can('create')) {
            $model = new History();

            $stakeholders = Stakeholder::find()->all();