backend/controllers/InterventionController.php

    public function actionViewIntervention()
    {
        // Fetch all Intervention
        $models = Intervention::find()->all();
---
SELECT * FROM `giz_intervention`

    protected function findModel($intervention_id)
    {
        if (($model = Intervention::findOne(['intervention_id' => $intervention_id])) !== null) {
---
SELECT * FROM `giz_intervention` WHERE `intervention_id`='6'