backend/controllers/SalesDetailsController.php

    public function actionViewSalesDetails()
    {
        $models = SalesDetails::find()->all();

        // Fetch additional information for each sales_id
        $salesInfo = SalesAchieved::find()
            ->select(['sales_id', 'month_year', 'rep_id'])
            ->distinct()
            ->where(['in', 'sales_id', ArrayHelper::getColumn($models, 'sales_id')])
            ->asArray()
            ->all();
---
SELECT * FROM `sales_details`
SELECT DISTINCT `sales_id`, `month_year`, `rep_id` FROM `sales_achieved` WHERE `sales_id`=2