backend/controllers/SalesTargetsController.php

SELECT * FROM `sales_targets`
---
    public function actionViewSalesTargets()
    {
        $models = SalesTargets::find()->all();