backend/controllers/SiteController.php

SELECT `users`.`name` AS `rep_name`, SUM(sales_targets.sales_target_amount) AS `sales_target` FROM `sales_targets` LEFT JOIN `sales_representatives` ON `sales_targets`.`rep_id` = `sales_representatives`.`rep_id` LEFT JOIN `users` ON `sales_representatives`.`id` = `users`.`id` WHERE `sales_targets`.`month_year`='Dec 2022' GROUP BY `users`.`name`
SELECT `users`.`name` AS `rep_name`, SUM(sales_achieved_amount) AS `sales_achieved` FROM `sales_achieved` LEFT JOIN `sales_representatives` ON `sales_achieved`.`rep_id` = `sales_representatives`.`rep_id` LEFT JOIN `users` ON `sales_representatives`.`id` = `users`.`id` WHERE `sales_achieved`.`month_year`='Dec 2022' GROUP BY `users`.`name`
---
    private function getSalesChartData($monthYear)
    {
        // Your logic to fetch and process the chart data here
        $labels = []; // Sales representative names
        $salesTargets = []; // Sales target amounts
        $salesAchieved = []; // Sales achieved amounts

        // Retrieve sales target data for the selected month and year
        $salesTargetData = SalesTargets::find()
            ->select(['users.name AS rep_name', 'SUM(sales_targets.sales_target_amount) as sales_target'])
            ->joinWith(['rep.user']) // Assuming you have a relation named 'rep' linking to 'SalesRepresentatives' and 'user' linking to 'Users'
            ->where(['sales_targets.month_year' => $monthYear])
            ->groupBy(['users.name'])
            ->asArray()
            ->all();
        //    var_dump($salesTargetData);


        // Process $salesTargetData to populate $labels and $salesTargets arrays

        // Retrieve sales achieved data for the selected month and year
        $salesAchievedData = SalesAchieved::find()
            ->select(['users.name AS rep_name', 'SUM(sales_achieved_amount) as sales_achieved'])
            ->joinWith(['rep.user']) // Assuming similar relations as in the sales target data
            ->where(['sales_achieved.month_year' => $monthYear])
            ->groupBy(['users.name'])
            ->asArray()
            ->all();