backend/controllers/StakeholderController.php

    public function actionViewStakeholder()
 {
        $models = Stakeholder::find()->all();
---
SELECT * FROM `stakeholder`

    public function actionViewStakeholderDetails( $stakeholder_id )
 {
        // Fetch the contact record to ensure it exists
        $model = Stakeholder::findOne( $stakeholder_id );
---
SELECT * FROM `stakeholder` WHERE `stakeholder_id`='16'

    public function actionDelete($stakeholder_id)
    {
        if ( Yii::$app->user->can( 'delete' ) ) {
        // Check if there are associated contact records
        $hasContacts = Contact::find()->where(['stakeholder_id' => $stakeholder_id])->exists();

        // Check if there are associated giz_interventions_history records
        $hasInterventionsHistory = History::find()->where(['stakeholder_id' => $stakeholder_id])->exists();

        if ($hasContacts || $hasInterventionsHistory) {
            Yii::$app->session->setFlash('error', '--------------------------------Cannot delete the `Stakeholder` because there are associated records in `Intervention History/Contacts`--------------------');

        } else {
            $this->findModel($stakeholder_id)->delete();
---
SELECT EXISTS(SELECT * FROM `contacts` WHERE `stakeholder_id`='16')
DELETE FROM `stakeholder` WHERE `stakeholder_id`=70

    protected function findModel( $stakeholder_id )
 {
        if ( ( $model = Stakeholder::findOne( [ 'stakeholder_id' => $stakeholder_id ] ) ) !== null ) {
---
SELECT * FROM `stakeholder` WHERE `stakeholder_id`='16'