backend/controllers/UserController.php

    public function actionViewUser()
 {
        if ( Yii::$app->user->can( 'userview' ) ) {
            $models = Users::find()->all();
---
SELECT * FROM `users`