common/models/SalesTargets.php

    public static function getMonthYearDropdowns()
    {
        $monthYearData = self::find()
            ->select(['month_year'])
            ->distinct()
            ->orderBy(['month_year' => SORT_DESC])
            ->asArray()
            ->all();
---
SELECT DISTINCT `month_year` FROM `sales_targets` ORDER BY `month_year` DESC

    public static function getSalesRepresentativesDropdowns()
    {
        $representatives = SalesTargets::find()
            ->select(['sales_representatives.rep_id', 'users.name AS rep_name'])
            ->leftJoin('sales_representatives', 'sales_representatives.rep_id = sales_targets.rep_id')
            ->leftJoin('users', 'users.id = sales_representatives.id')
            ->distinct()
            ->orderBy(['rep_name' => SORT_ASC])
            ->asArray()
            ->all();
---
SELECT DISTINCT `sales_representatives`.`rep_id`, `users`.`name` AS `rep_name` FROM `sales_targets` LEFT JOIN `sales_representatives` ON sales_representatives.rep_id = sales_targets.rep_id LEFT JOIN `users` ON users.id = sales_representatives.id ORDER BY `rep_name`