common/models/Stakeholder.php

    public static function getChartData($params=[])
    {
        $query = self::find()->select(['stakeholder_category','count(stakeholder_category) as count']);
        $query->where("1=1");
        foreach($params as $param)
        {
            $query->andWhere($param);
        }

        $stakeholderCategories = $query
            ->groupBy('stakeholder_category')
            ->asArray()->all();
---
SELECT `stakeholder_category`, count(stakeholder_category) AS `count` FROM `stakeholder` WHERE 1=1 GROUP BY `stakeholder_category`

    public static function getLocationDropdowns()
    {
       return  self::find()->select('organizational_location')
       ->where(['!=','organizational_location',''])
        ->groupBy('organizational_location')
        ->asArray()->all();
---
SELECT `organizational_location` FROM `stakeholder` WHERE `organizational_location` != '' GROUP BY `organizational_location`

    public static function getCategoryCounts()
    {
        $stakeholders = self::find()->all();
---
SELECT * FROM `stakeholder`