common/models/Users.php

SELECT * FROM `users` WHERE (`id`=3) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `users` WHERE (`username`='w16') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);