backend/views/history/add-history.php

SELECT * FROM `stakeholder`
SELECT * FROM `giz_project`
SELECT * FROM `giz_intervention`
---
            <div class="history-form">

                <?php
        $stakeholders = Stakeholder::find()->all();
        $stakeholderList = ArrayHelper::map($stakeholders, 'stakeholder_id', 'organization_name');

        $projects = Project::find()->all();
        $projectList = ArrayHelper::map($projects, 'project_id', 'name_of_module');

        $interventions = Intervention::find()->all();